# Ejercicios

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## Def.

* **vector**: array unidimensional
* **matriz**: array bidimensional

### .

#### Descargar los datos del dataset [boston](https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/csv/MASS/Boston.csv'), almacenarlos en un dataframe, y aplicarle el promedio a la columna `lstat`

In [5]:
url = 'https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/csv/MASS/Boston.csv'
df = pd.read_csv(url)
df.head(2)

,Unnamed: 0,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv
0,1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.9,4.98,24.0
1,2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.9,9.14,21.6

In [10]:
np.average(df['lstat'].values)

12.653063241106722

12.653063241106722

#### Crear 2 series con indices iguales y concatenarlas

In [17]:
serie1 = pd.Series(np.arange(1, 5), index=['a', 'b', 'c', 'd'])
serie2 = pd.Series(np.arange(5, 9), index=['a', 'b', 'c', 'd'])
pd.concat([serie1, serie2])

a    1
b    2
c    3
d    4
a    5
b    6
c    7
d    8
dtype: int64

a    1
b    2
c    3
d    4
a    5
b    6
c    7
d    8
dtype: int64

#### Crear 2 series con indices iguales y concatenarlas, pero la serie resultante debe quedar con indices unicos

In [18]:
serie1 = pd.Series(np.arange(1, 5))
serie2 = pd.Series(np.arange(5, 9))
pd.concat([serie1, serie2], ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

## ...

## `SELECT * FROM empleado`
Cargar los datos del archivo `empleado.csv` a un dataframe llamado `empleado`

In [29]:
empleado = pd.read_csv('datos/Empleado.csv', sep=';')
empleado

,Nombre,Apellido1,Apellido2,Dni,FechaNac,Dirección,Sexo,Sueldo,SuperDni,Dno
0,José,Pérez,Pérez,123456789,01-09-1965,"Eloy I, 98",H,30000,333445555.0,5
1,Alberto,Campos,Sastre,333445555,08-12-1955,"Avda. Ríos, 9",H,40000,888665555.0,5
2,Alicia,Jiménez,Celaya,999887777,12-05-1968,"Gran Via, 38",M,25000,987654321.0,4
3,Juana,Sainz,Oreja,987654321,20-06-1941,"Cerquillas, 67",M,43000,888665555.0,4
4,Fernando,Ojeda,Ordóñez,666884444,15-09-1962,"Portilo, s/n",H,38000,333445555.0,5
5,Aurora,Oliva,Avezuela,453453453,31-07-1972,"Antón, 6",M,25000,333445555.0,5
6,Luis,Pajares,Morera,987987987,29-03-1969,"Enebros, 90",H,25000,987654321.0,4
7,Eduardo,Ochoa,Paredes,888665555,10-11-1937,"Las Peñas, 1",H,55000,NaN,1

In [21]:
departamento = pd.read_csv('datos/Departamento.csv', sep=';')
departamento

       NombreDpto  NumeroDpto  DniDirector FechaIngresoDirector
0   Investigación           5    333445555           22-05-1988
1  Administración           4    987654321           01-01-1995
2    Sede Central           1    888665555           19-06-1981

In [22]:
localizaciones_depto = pd.read_csv('datos/Localizaciones_Dpto.csv', sep=';')
localizaciones_depto

   NumeroDpto UbicacionDpto
0           1        Madrid
1           4         Gijón
2           5      Valencia
3           5       Sevilla
4           5        Madrid

SELECT nombre, apellido1, fecha_nac 
FROM empleado

In [35]:
empleado[['Nombre', 'Apellido1', 'FechaNac']]

     Nombre Apellido1    FechaNac
0      José     Pérez  01-09-1965
1   Alberto    Campos  08-12-1955
2    Alicia   Jiménez  12-05-1968
3     Juana     Sainz  20-06-1941
4  Fernando     Ojeda  15-09-1962
5    Aurora     Oliva  31-07-1972
6      Luis   Pajares  29-03-1969
7   Eduardo     Ochoa  10-11-1937

SELECT nombre 
FROM empleado 
WHERE sueldo > 40000

In [39]:
empleado.loc[empleado.Sueldo > 40000, ['Nombre']]

    Nombre
3    Juana
7  Eduardo

SELECT dni 
FROM empleado 
WHERE dno = 5 AND sexo = 'H'

In [43]:
empleado.loc[(empleado.Dno == 5) & (empleado.Sexo == 'H'), ['Dni']]

         Dni
0  123456789
1  333445555
4  666884444

SELECT nombre, apellido1, direccion
FROM empleado, departamento
WHERE nombre_depto = 'Investigación' AND numero_depto = dno;

In [53]:
empleado_departamento = pd.merge(empleado, departamento, how = 'right', left_on = 'Dni', right_on = 'DniDirector')
empleado_departamento.loc[(empleado_departamento.NombreDpto == 'Investigación') & (empleado_departamento.NumeroDpto == empleado_departamento.Dno), ['Nombre', 'Apellido1', 'Dirección']]

    Nombre Apellido1      Dirección
0  Alberto    Campos  Avda. Ríos, 9

SELECT *
FROM empleado
WHERE (sueldo BETWEEN 30000 AND 40000) AND dno = 5;

In [59]:
empleado.loc[(empleado.Sueldo.between(30000, 40000)&(empleado.Dno == 5))]

,Nombre,Apellido1,Apellido2,Dni,FechaNac,Dirección,Sexo,Sueldo,SuperDni,Dno
0,José,Pérez,Pérez,123456789,01-09-1965,"Eloy I, 98",H,30000,333445555.0,5
1,Alberto,Campos,Sastre,333445555,08-12-1955,"Avda. Ríos, 9",H,40000,888665555.0,5
4,Fernando,Ojeda,Ordóñez,666884444,15-09-1962,"Portilo, s/n",H,38000,333445555.0,5

SELECT distinct dni_empleado
FROM empleado
WHERE num_proyecto in (1, 2, 3);

SELECT nombre, apellido1
FROM (empleado
JOIN departamento ON dno = numero_depto)
WHERE nombre_depto = 'Investigación';

In [61]:
empleado_departamento = pd.merge(empleado, departamento, how = 'right', left_on = 'Dno', right_on = 'NumeroDpto')
empleado_departamento.loc[empleado_departamento.NombreDpto == 'Investigación', ['Nombre', 'Apellido1']]

     Nombre Apellido1
0      José     Pérez
1   Alberto    Campos
2  Fernando     Ojeda
3    Aurora     Oliva

SELECT SUM(sueldo), MAX(sueldo), MIN(sueldo), AVG(sueldo)
FROM empleado;

In [66]:
pd.DataFrame(pd.Series({'Suma Sueldo': np.sum(empleado.Sueldo), 'Maximo Sueldo': np.max(empleado.Sueldo), 'Minimo Sueldo': np.min(empleado.Sueldo), 'Promedio Sueldo': np.average(empleado.Sueldo)}))

                        0
Maximo Sueldo     55000.0
Minimo Sueldo     25000.0
Promedio Sueldo   35125.0
Suma Sueldo      281000.0

SELECT dno, AVG(sueldo)
FROM empleado
GROUP BY dno;

In [76]:
empleado[['Dno', 'Sueldo']].groupby('Dno').mean()

     Sueldo
Dno
1     55000
4     31000
5     33250

#### Graficar en una imagen los sueldos de los empleados, mostrando `nombre` en un eje y `sueldo` en otro eje